system design complete concepts
